[
    {
        "code": "OLV01",
        "name": "Balaclava Park",
        "city": "Vancouver",
        "area": "Dunbar-Southlands",
        "details": "Balaclava Park is an expansive park, noted for its beautiful Hedge Maple trees, located in a quiet neighbourhood and is a pleasant place for walking or jogging. Balaclava’s grassy fields are frequented by sports teams, neighbours, and children alike. Balaclava Park offers a playground, wading pool, running track, rugby field, softball and an off leash dog area. This recreational greenspace is also perfect for picnics!",
        "lat": 49.24470507020434,
        "lng": -123.17507131392392
    },
    {
        "code": "OLV02",
        "name": "Devonian Harbour Park",
        "city": "Vancouver",
        "area": "Downtown",
        "details": "This elegant park offers many peaceful seating areas and serves as a gateway between Stanley Park and Coal Harbour. Devonian Harbour Park offers something for everyone, whether throwing a ball on the rolling lawns, enjoying the magical views of the harbour and pond, or contemplating the interesting sculptures.",
        "lat": 49.29496162924832,
        "lng": -123.13434601446576
    },
    {
        "code": "OLV03",
        "name": "Falaise Park",
        "city": "Vancouver",
        "area": "Renfrew-Collingwood",
        "details": "With four adjacent sections, Falaise Park stretches into the surrounding community. The rolling slopes are pleasant to walk, with tree-framed views of Vancouver and Burnaby available from nearly all corners of the park. The slopes that afford the expansive views also provide prime sledding ground for winter fun.",
        "lat": 49.2556804415666,
        "lng": -123.02750074280294
    },
    {
        "code": "OLV04",
        "name": "Southeast False Creek Park",
        "city": "Vancouver",
        "area": "Mount Pleasant",
        "details": "Southeast False Creek is designed as a mixed-use community with a total population of 11,000 to 13,000 people, with a focus on residential housing. As a complete neighbourhood – with the 2010 Olympic Village at its core – Southeast False Creek will have goods and services within walking distance, and housing and jobs that are accessible by transit.",
        "lat": 49.27118798617408,
        "lng": -123.11098369199883
    },
    {
        "code": "OLV05",
        "name": "Jones Park",
        "city": "Vancouver",
        "area": "Kensington-Cedar Cottage",
        "details": "Welcomed by flowers and benches, visitors of Jones Park will find a pleasant open space through which to walk. A playground, surrounded by majestic western redcedars, is a popular space for children; the Midtown Bikeway also passes through this park.",
        "lat": 49.235945148740775,
        "lng": -123.06691167074283
    },
    {
        "code": "OLV06",
        "name": "Killarney Park",
        "city": "Vancouver",
        "area": "Killarney",
        "details": "Killarney combines open space and community facilities to provide a wide range of recreation opportunities. For those with something quieter in mind, try walking the tree-lined paths or relaxing in the pine grove or rainwater garden.",
        "lat": 49.22711615721119,
        "lng": -123.04660137247627
    },
    {
        "code": "OLV07",
        "name": "Kingcrest Park",
        "city": "Vancouver",
        "area": "Kensington-Cedar Cottage",
        "details": "Just over a grassy hill, Kingcrest’s slopes reveal a park full of curving pathways and open spaces. Rest in the shade of the beautiful linden grove, or enjoy a picnic in the sunshine.",
        "lat": 49.24754513634842,
        "lng": -123.07392010305213
    },
    {
        "code": "OLV08",
        "name": "Musqueam Park",
        "city": "Vancouver",
        "area": "Dunbar-Southlands",
        "details": "This large park is predominantly lush natural forest containing a series of trails enjoyed by those on horseback and foot alike. The fern- and thimbleberry-lined paths are often silent, except for the bird calls that bloom from the depths of the forest. A large clearing accommodates two soccer fields.",
        "lat": 49.231980422957584,
        "lng": -123.19315344144853
    },
    {
        "code": "OLV09",
        "name": "Quilchena Park",
        "city": "Vancouver",
        "area": "Arbutus Ridge",
        "details": "Quilchena’s wide green fields are welcoming to sports enthusiasts and those looking for a pleasant stroll alike. Majestic poplars tower over the rolling lawns and shelter the seating areas below.",
        "lat": 49.24309791365466,
        "lng": -123.14769992982717
    },
    {
        "code": "OLV10",
        "name": "Spanish Banks Park",
        "city": "Vancouver",
        "area": null,
        "details": "Located along Northwest Marine Dr west of Tolmie St, Spanish Banks Beach is composed of three distinct sections, east, west, and extension. At low tide, the water is one kilometre off shore.",
        "lat": 49.278746328517386,
        "lng": -123.23234034857063
    },
    {
        "code": "OLV11",
        "name": "Sunrise Park",
        "city": "Vancouver",
        "area": "Hastings-Sunrise",
        "details": "Balanced atop a hill at one of the neighbourhood’s highest points, the slopes of Sunrise Park offer appealing views of Capitol Hill, Burnaby Mountain, and, of course, a special sunrise. The open and inspiring setting is also great for a variety of outdoor sports.",
        "lat": 49.26683490730779,
        "lng": -123.03496507364125
    },
    {
        "code": "OLV12",
        "name": "Charleson Park",
        "city": "Vancouver",
        "area": "Fairview",
        "details": "Peaceful pathways wind through lush plantings and around a waterfall and pond, opening to striking views of the downtown shoreline. Whether passing through on the seawall or staying awhile to enjoy the park, Charleson is sure to make your day a bit more relaxing",
        "lat": 49.26771430195519,
        "lng": -123.12264188086404
    },
    {
        "code": "OLV13",
        "name": "Crab Park at Portside",
        "city": "Vancouver",
        "area": "Downtown",
        "details": "From atop a grassy knoll or the small pier jutting into Burrard Inlet, this is a good place to get a close look at Vancouver’s working port, with views of the colourful containers, cruise ships, heliport, and SeaBuses. Arriving from the Main Street overpass, two Chinese lion statues frame views of the peaks of the Lions; several more beautiful and moving monuments and sculptures can be found throughout the park.",
        "lat": 49.2851670652176,
        "lng": -123.10130226889473
    },
    {
        "code": "OLV14",
        "name": "Everett Crowley Park",
        "city": "Vancouver",
        "area": "Killarney",
        "details": "Everett Crowley is a green sanctuary. From the views of patterned Richmond farmlands to the tranquil New Kinross Creek and Avalon Pond, many people enjoy the variety of informal spaces in this park; there are many trails and quiet places to enjoy choruses of birds and a lush woodland feel.",
        "lat": 49.210568819287346,
        "lng": -123.03641426179514
    },
    {
        "code": "OLV17",
        "name": "Fraser River Park",
        "city": "Vancouver",
        "area": "Kerrisdale",
        "details": "One of the most tranquil and inspiring spots in the area, Fraser River Park achieves a pleasing balance between natural and designed settings. Large rolling lawns are perfect for picnicking or flying a kite, and beautiful views of the Fraser River are available from the boardwalks that cross restored tidal marshes and snake between stands of poplar and alder trees. ",
        "lat": 49.208141642292624,
        "lng": -123.15184197086442
    },
    {
        "code": "OLV18",
        "name": "Hadden Park",
        "city": "Vancouver",
        "area": "Kitsilano",
        "details": "Home of the Vancouver Maritime Museum, Hadden Park is filled with fascinating bits of Vancouver history, with historic vessels often docking in harbour. The sparkling waters of English Bay are a popular attraction at most times of the year. This park includes a dogs off-leash area with water front access.",
        "lat": 49.27795379114207,
        "lng": -123.14819708917254
    },
    {
        "code": "OLV19",
        "name": "New Brighton Park",
        "city": "Vancouver",
        "area": "Hastings-Sunrise",
        "details": "An unusual combination of outdoor recreation space, industrial facilities, and memorable views, New Brighton is a popular and exciting park. Captivating views of the North Shore, Burrard Inlet, and the grain elevators of Cascadia Terminals are available from the walking trails, outdoor pool, and beach areas.",
        "lat": 49.2904810792187,
        "lng": -123.03679074019166
    },
    {
        "code": "OLV20",
        "name": "Oak Meadows Park",
        "city": "Vancouver",
        "area": "South Cambie",
        "details": "This park was redeveloped to include a soccer field and two Ultimate (see link under Related Links below) playing fields. The park also features an off-leash dog meadow, children's play area and natural, treed areas.",
        "lat": 49.238390851643665,
        "lng": -123.12704483617387
    },
    {
        "code": "OLV21",
        "name": "Queen Elizabeth Park",
        "city": "Vancouver",
        "area": "Riley Park",
        "details": "Queen Elizabeth Park, Vancouver's horticultural jewel, is a major draw for floral display enthusiasts and view-seekers, and as a popular backdrop for wedding photos. At 125 m above sea level, it's the highest point in Vancouver and makes for spectacular views of the park, city, and mountains on the North Shore.",
        "lat": 49.23779204269339,
        "lng": -123.11094065628153
    },
    {
        "code": "OLV22",
        "name": "Sparwood Park",
        "city": "Vancouver",
        "area": "Killarney",
        "details": "Sparwood Park is home to both small wooded areas and open lawns. Stroll through the beautiful allée of hazelnut trees, or slip through one of the many curving paths and walkways that extend from Sparwood Park into the surrounding neighbourhoods.",
        "lat": 49.220115926013904,
        "lng": -123.02907370038434
    },
    {
        "code": "OLV23",
        "name": "Stanley Park",
        "city": "Vancouver",
        "area": null,
        "details": "Stanley Park is a magnificent green oasis in the midst of the urban landscape of Vancouver. Explore the 400-hectare natural West Coast rainforest and enjoy scenic views of water, mountains, sky, and majestic trees along Stanley Park's famous Seawall. Discover kilometres of trails, beautiful beaches, local wildlife, great eats, natural, cultural and historical landmarks, along with many other adventures. The park offers a wide range of unforgettable experiences for all ages and interests, including Canada’s largest aquarium.",
        "lat": 49.292584113556245,
        "lng": -123.14495182029219
    },
    {
        "code": "OLV24",
        "name": "Strathcona Park",
        "city": "Vancouver",
        "area": "Strathcona",
        "details": "This unique park offers much to its visitors, from skatepark and climbing wall (both added during park restorations in 2004), to community gardens and sports fields. The heart of the park is a charming place to rest or play, while the community gardens and pathways that line the perimeter make for a pleasant stroll.",
        "lat": 49.27551393859565,
        "lng": -123.0865140597334
    },
    {
        "code": "OLV25",
        "name": "Valdez Park",
        "city": "Vancouver",
        "area": "Dunbar-Southlands",
        "details": "A small open park, Valdez is a nice place to enjoy some sunshine or play ball. Large plane trees line the perimeter, making this park a pleasant place to stop by on an evening stroll.",
        "lat": 49.25237108095537,
        "lng": -123.17645323219303
    },
    {
        "code": "OLV26",
        "name": "Charleson Park",
        "city": "Vancouver",
        "area": "Fairview",
        "details": "Peaceful pathways wind through lush plantings and around a waterfall and pond, opening to striking views of the downtown shoreline. Whether passing through on the seawall or staying awhile to enjoy the park, Charleson is sure to make your day a bit more relaxing.",
        "lat": 49.26719997068881,
        "lng": -123.12448776465106
    },
    {
        "code": "OLV27",
        "name": "Coopers' Park",
        "city": "Vancouver",
        "area": "Downtown",
        "details": "Bordering False Creek, the winding paths and numerous benches of Coopers’ Park are all excellent places to enjoy the expansive views. The site of Sweeney Cooperage and Sawmill until 1981, the site now contains a playground and skate park (added in 2003) tucked under the Cambie Street Bridge, as well as plenty of open lawn and colourful plantings.",
        "lat": 49.27353645619341,
        "lng": -123.11314457767041
    },
    {
        "code": "OLV28",
        "name": "Dusty Greenwell Park",
        "city": "Vancouver",
        "area": "Hastings-Sunrise",
        "details": "Dusty Greenwell’s rolling green slopes provide a perfect place for taking in the fascinating views of the Second Narrows Bridge, industrial yards, and passing ships. With North Vancouver and the North Shore Mountains rising majestically from Burrard Inlet, this small park is a truly wonderful place to sit and take in some of Vancouver’s most distinctive features.",
        "lat": 49.29210780606712,
        "lng": -123.04764287218421
    },
    {
        "code": "OLV29",
        "name": "Emery Barnes Park",
        "city": "Vancouver",
        "area": "Downtown",
        "details": "This small urban oasis offers many pleasant seating areas for eating lunch, reading a paper, or playing a game of chess. A fast-flowing stream culminates in a tiered fountain surrounded by pergolas and lush plantings. When the bright flowers of the summer have faded, mosaics in the streambed and next to the pathway continue to add colour throughout the winter.",
        "lat": 49.27711482880213,
        "lng": -123.12371511269338
    },
    {
        "code": "OLV30",
        "name": "Fraserview Golf Course",
        "city": "Vancouver",
        "area": "Killarney",
        "details": "Fraserview Golf Course offers an old course feeling in a West Coast setting. This well-maintained, traditional-style course offers topographical changes along majestic, tree-lined fairways, and overlooks the Fraser River.",
        "lat": 49.21632474891052,
        "lng": -123.04764770721968
    },
    {
        "code": "OLV31",
        "name": "George Park",
        "city": "Vancouver",
        "area": "Sunset",
        "details": "With rolling hills covered in a lovely collection of coniferous and deciduous trees, George Park is a particularly pleasant place to stroll. The picnic shelter is a popular gathering place for people in the neighbourhood.",
        "lat": 49.21260115892472,
        "lng": -123.09436750172519
    },
    {
        "code": "OLV32",
        "name": "John Hendry Park",
        "city": "Vancouver",
        "area": "Kensington-Cedar Cottage",
        "details": "It’s not surprising that John Hendry Park is such a popular destination; tranquil Trout Lake and a wide range of active and passive recreation opportunities create an exceptional setting. The beach area and wildlife habitat around the lake can almost make one forget that that the park is in the city, especially when illuminated with glowing lights at the annual lantern festival.",
        "lat": 49.25752317555785,
        "lng": -123.06219593641522
    },
    {
        "code": "OLV33",
        "name": "Locarno Park",
        "city": "Vancouver",
        "area": "West Point Grey",
        "details": "Like its neighbouring parks lining English Bay, Locarno Beach Park offers lovely sand beaches that are enjoyed by many. The park also includes a picnic area surrounded by beautifully textured cedars, woodland areas, and an open playing field.",
        "lat": 49.273031242319895,
        "lng": -123.20651170534614
    },
    {
        "code": "OLV34",
        "name": "Nat Bailey Stadium Park",
        "city": "Vancouver",
        "area": "Riley Park",
        "details": "Rising from its spot nestled between Queen Elizabeth, Hillcrest, and Riley Parks, historic Nat Bailey Stadium is home to the Vancouver Canadians baseball team. Several grassed areas surrounding the stadium are also pleasant for strolling or enjoying the sunshine.",
        "lat": 49.2418428106307,
        "lng": -123.10620807497806
    },
    {
        "code": "OLV35",
        "name": "Nelson Park",
        "city": "Vancouver",
        "area": "West End",
        "details": "Located in the heart of the beautiful West End, Nelson Park offers lawns and seating areas that are enjoyed by all. The redeveloped park features new entryways, an elegant pathway system, seating plaza, metal arbours and a restful water feature. The off-leash dog area on the park's west side is enclosed with decorative metal fencing.",
        "lat": 49.283039927341825,
        "lng": -123.130485218247
    },
    {
        "code": "OLV36",
        "name": "Sunset Beach Park",
        "city": "Vancouver",
        "area": "West End",
        "details": "One of Vancouver’s spectacular beach parks, a seat on a bench under the lacy black locust trees will quickly charm with its views of English Bay and Vanier Park. While lovely from the seawall, a step into the park reveals the large lawns and sandy beaches that are loved by sunbathers, soccer players, and those out for an invigorating stroll.",
        "lat": 49.27604924181608,
        "lng": -123.13603413954836
    },
    {
        "code": "OLV37",
        "name": "Tecumseh Park",
        "city": "Vancouver",
        "area": "Victoria-Fraserview",
        "details": "Tecumseh was officially opened in September 2010 after a $500,000 upgrade. The upgrades include new play equipment and seating area, paved areas to accommodate tai chi practitioners, levelled lawn areas, improved drainage and new pathways around the perimeter. A prominent feature in the children's playground is a bright red 1940s tractor which has been modified to be child-friendly.",
        "lat": 49.22977226548035,
        "lng": -123.069920056114
    },
    {
        "code": "OLB01",
        "name": "Barnet Marine Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Seasonal time restrictions on the trail and open area have been lifted. The park and trail are now open for off-leash activity year-round from dawn until dusk. Dogs must be leashed outside of designated off-leash area.",
        "lat": 49.29048,
        "lng": -122.93014
    },
    {
        "code": "OLB02",
        "name": "Bell Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Also known locally as Eastlake Park. Partial enclosure with access year-round adjacent to a fully enclosed basketball court. ",
        "lat": 49.2523,
        "lng": -122.90488
    },
    {
        "code": "OLB03",
        "name": "Burnaby Fraser Foreshore Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Open area and trail on Byrne Creek Dike with access year-round. Dogs must be leashed outside of designated off-leash area and trail. Please use caution at road crossings on Byrne Creek Dike off-leash trail.",
        "lat": 49.1925934,
        "lng": -122.9994676
    },
    {
        "code": "OLB04",
        "name": "Burnaby Heights Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Enclosed area with access year-round.",
        "lat": 49.246445,
        "lng": -122.994560
    },
    {
        "code": "OLB05",
        "name": "Confederation Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Fenced enclosure for all dogs, separate fenced enclosure for small dogs only, and off-leash loop trail north of Penzance Dr with access year-round.",
        "lat": 49.248809,
        "lng": -122.980510
    },
    {
        "code": "OLB06",
        "name": "David Gray Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Fenced enclosure with separate area for small dogs only, access year-round.",
        "lat": 49.216405,
        "lng": -123.007392
    },
    {
        "code": "OLB07",
        "name": "Malvern Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Trail and open area with access year-round.",
        "lat": 49.22797,
        "lng": 79.2172
    },
    {
        "code": "OLB08",
        "name": "Robert Burnaby Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Trail and open area (hydro corridor and lawn area west of Ramsay Creek) with access year-round. Dogs must be leashed outside of designated off-leash area.",
        "lat": 49.2334,
        "lng": 122.9337
    },
    {
        "code": "OLB09",
        "name": "Taylor Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Fenced enclosure with access year-round.",
        "lat": 49.2751,
        "lng": 125.0413
    },
    {
        "code": "OLB10",
        "name": "Warner Loat Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Fenced enclosure with access year-round, a block away from the Piper Ave entrance of Burnaby Lake Regional Park.",
        "lat": 49.24682,
        "lng": -122.93416
    },
    {
        "code": "OLB11",
        "name": "Willingdon Heights Park",
        "city": "Burnaby",
        "area": "null",
        "details": "Fenced enclosure with access year-round. Park is open for use while the on-site agility course is being completed.",
        "lat": 49.2717,
        "lng": 123.0131
    }
]